test/IO/fileHandler/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            totalPressure;
        p0              $internalField;
        value           $internalField;
    }
    outlet
    {
        type            totalPressure;
        p0              $internalField;
        value           $internalField;
    }
    walls
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
